#ifndef _PARAMS_H_
#define _PARAMS_H_

#define BUSY_STR_ADR 0
#define CMD_CANC_ADR 1
#define EXPR_STR_ADDR 4
#define MPU_BLOCKED_ADR 32
#define CONFIRM_ADDR 34
#define CORR_PASS_ADDR 36
#define WRONG_PASS_ADDR 38
#define PASS_RESET_ADDR 40
#define EDIT_DISABLE_ADDR 42
#define CODE_DONT_MATCH_ADDR 44
#define CALIB_EN_ADDR 46
#define CALIB_DIS_ADDR 48
#define SET_LVLS_ADDR 50
#define DATA_SAVED_ADDR 52
#define ENC_TEST_ON 54
#define DO_LAUNCH_ADDR 56
#define TO_OPENED_ADDR 57
#define TO_CLOSED_ADDR 58
#define ENC_TEST_OVER_ADDR 59
#define ENC_SUCCESS_ADDR 61
#define ENC_FAIL_ADDR 63

#define NUM_ICONS 5
#define CODE_ICO 0x00
#define CONN_ICO 0x01
#define BT_ICO 0x02
#define CODEON_ICO 0x03
#define CODEOFF_ICO 0x04

#ifdef CREATE_STRUCTS

#define GR_OFFSET 0
#define GR_INIT(GR, D) GetAdr(GR) + GR_OFFSET + D, sizeof(T##GR##) - D

const struct MENU_GROUP groups[] = {
	//! цПСООШ
	"   1 цпсоою A   ", "    хмдхйюжхъ   ", GR_INIT(GroupA, 0),
	"   2 цпсоою B   ", "онкэг мюярпнийх ", GR_INIT(GroupB, 0),
	"   3 цпсоою C   ", "гюбнд мюярпнийх ", GR_INIT(GroupC, 0),
	"   4 цпсоою D   ", "    йнлюмдш     ", GR_INIT(GroupD, 0),
	"   6 цпсоою E   ", "     фспмюк     ", GR_INIT(GroupE, 2)
	//! цПСООШ ЙНМЕЖ
};

const struct MENU_PARAM params[] = {
	//! оЮПЮЛЕРПШ
	//! цПСООЮ р
	"р0.реумнк. пец. ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),							// 0
	"р1.пец. детейр. ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),							// 1
	"р2.онкнфемхе    ", "    ", -1000U, 2000, 0, MT_DEC | M_RONLY | M_SIGN | M_RMAX(3) | M_PREC(1), // 2
	"р3.йнлюмдю      ", "    ", 0, 65535, 0, MT_DEC | M_PWP1 | M_RMAX(4),							// 3
	"р4.явервхй жхйк.", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),							// 4
	//! цПСООЮ б
	"B0.лнлемр гюйп  ", "м*л ", 1, 11, 2, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 40
	"B1.лнлемр нрйп  ", "м*л ", 1, 11, 2, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 41
	"B2.лнл сок гюйп ", "м*л ", 1, 11, 2, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 42
	"B3.лнл рпнц гюйп", "м*л ", 1, 11, 4, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 43
	"B4.лнл сок нрйп ", "м*л ", 1, 11, 2, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 44
	"B5.лнл рпнц нрйп", "м*л ", 1, 11, 4, MT_DEC | M_PWP1 | M_NVM | M_KMM | M_RMAX(4), // 45
	"B6.рхо гюдбхфйх ", "    ", 0, 1, 0, MT_STR | M_PWP1 | M_NVM | M_SADR(124),		   // 46
	"B7.рхо сокнрмем ", "    ", 1, 4, 1, MT_STR | M_PWP1 | M_NVM | M_SADR(126),		   // 47
	"B8.рхо ьрнйю    ", "    ", 0, 1, 0, MT_STR | M_PWP1 | M_NVM | M_SADR(131),		   // 48
	//! цПСООЮ я
	" я0.йнд днярсою ", "    ", 0, 65530, 0, MT_DEC | M_RMAX(4),				 // 90
	"   я01.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),		 // 91
	"я2.цнд хгцнрнбк ", "    ", 0, 99, 18, MT_DEC | M_PWP2 | M_NVM | M_RMAX(1),	 // 92
	"я3.гюбнд мнлеп  ", "    ", 0, 9999, 0, MT_DEC | M_PWP2 | M_NVM | M_RMAX(3), // 93
	//! цПСООЮ D
	"D0.гюдюмхе гюйп ", "    ", 0, 2, 0, MT_STR | M_PWP1 | M_SADR(157), // 210
	"D1.гюдюмхе нрйп ", "    ", 0, 2, 0, MT_STR | M_PWP1 | M_SADR(157), // 211
	//! цПСООЮ G
	"G0.пефхл реярю  ", "    ", 0, 1, 0, MT_DEC | M_PWP2 | M_NVM | M_RMAX(1), // 230
	"G1.реяр ябернд  ", "    ", 0, 65530, 0, MT_BIN | M_PWP2 | M_RMAX(4),	  // 231
	//! цПСООЮ H
	"H0.яняр йюкхап  ", "    ", 0, 3, 0, M_HIDE,				 // 260
	"H1.  пегепб     ", "    ", 0, 65530, 0, MT_DEC | M_RMAX(4), // 261
	"H2.онкнф гюйп 1 ", "    ", 0, 65535, 0, M_HIDE | M_RMAX(4), // 262
	//! цПСООЮ ю
	"ю0.ярюрся пюанрш", "    ", 0, 65530, 0, MT_RUN | M_RONLY | M_SADR(1),				// 400
	"ю1.дхюц опнжеяяю", "    ", 0, 65530, 0, MT_RUN | M_RONLY | M_SADR(18),				// 401
	"ю2.дхюцмняр яерх", "    ", 0, 65530, 0, MT_RUN | M_RONLY | M_SADR(35),				// 402
	"ю3.дхюц мюцпсгйх", "    ", 0, 65530, 0, MT_RUN | M_RONLY | M_SADR(52),				// 403
	"ю4.дхюцм сярп-бю", "    ", 0, 65530, 0, MT_RUN | M_RONLY | M_SADR(69),				// 404
	"   ю8.лнлемр    ", "м*л ", 0, 11000, 0, MT_DEC | M_RONLY | M_RMAX(4),				// 408
	"   ю9.яйнпнярэ  ", "на/л", -3600U, 3600, 0, MT_DEC | M_RONLY | M_SIGN | M_RMAX(3), // 409
	"ю10.мюоп тюгш R ", "б   ", 0, 500, 0, MT_DEC | M_RONLY | M_RMAX(2),				// 410
	"ю11.мюоп тюгш S ", "б   ", 0, 500, 0, MT_DEC | M_RONLY | M_RMAX(2),				// 411
	"ю12.мюоп тюгш T ", "б   ", 0, 500, 0, MT_DEC | M_RONLY | M_RMAX(2),				// 412
	" ю13.рнй тюгш U ", "ю/% ", 0, 8000, 0, MT_DEC | M_RONLY | M_RMAX(3) | M_PREC(1),	// 413
	" ю14.рнй тюгш V ", "ю/% ", 0, 8000, 0, MT_DEC | M_RONLY | M_RMAX(3) | M_PREC(1),	// 414
	" ю15.рнй тюгш W ", "ю/% ", 0, 8000, 0, MT_DEC | M_RONLY | M_RMAX(3) | M_PREC(1),	// 415
	//! цПСООЮ E
	"E13.релоеп акнй ", "цпюд", -100U, 100, 0, MT_DEC | M_RONLY | M_SIGN | M_RMAX(2), //
	"E14.яняр бунднб ", "    ", 0, 65535, 0, MT_RUN | M_RONLY | M_SADR(86),			  //
	"E15.яняр бшунднб", "    ", 0, 65535, 0, MT_RUN | M_RONLY | M_SADR(103),		  //
	"   E16.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E17.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E18.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E19.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E20.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E21.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E22.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E23.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E24.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E25.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E26.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E27.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E28.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4),			  //
	"   E29.пегепб   ", "    ", 0, 65535, 0, MT_DEC | M_RONLY | M_RMAX(4)			  //
																					  //! оЮПЮЛЕРПШ ЙНМЕЖ
};

const struct MENU_STRING values[] = {
	//! яРПНЙХ
	"    гюохяэ      ", // 0
						//!----------------
	"  ме нопедекем  ", // 1
	"      ярно      ", // 2
	"     юбюпхъ     ", // 3
	" хдер гюйпшрхе  ", // 4
	" хдер нрйпшрхе  ", // 5
	"   хдер реяр    ", // 6
	"    гюйпшрн     ", // 7
	"    нрйпшрн     ", // 8
	"     лстрю      ", // 9
	" леярмне сопюбк ", // 10
	"  бйкчвем рем   ", // 11
#if BUR_M
	"    охрюмхе     ", // 12
#else
	" яепбхя охрюмхе ", // 12
#endif
	"юбюпхъ мю акнйе ", // 13
	"  юбюпхъ мю ря  ", // 14
	"  мехяопюбмнярэ ", // 15
	"мехяопюбм мю акй", // 16
	"мехяопюбм мю ря ", // 17
						//!----------------
	"   мер юбюпхи   ", // 18
	"  мер дбхфемхъ  ", // 19
	"  веп тюг дбхц  ", // 20
	" ме гюдюмн гюйп ", // 21
	" ме гюдюмн нрйп ", // 22
	" мер йюкхапнбйх ", // 23
	"сокнрм ме днярхц", // 24
	"  оепецпеб дбхц ", // 25
	"  мехяоп лс/дс  ", // 26
	"     пегепб     ", // 27
	"пефхл реу.опнцнм", // 28
	"     пегепб     ", // 29
	"     пегепб     ", // 30
	"     пегепб     ", // 31
	"     пегепб     ", // 32
	"     пегепб     ", // 33
	"     пегепб     ", // 34
						//!----------------
	"   мер юбюпхи   ", // 35
	"лхм мюоп тюгш R ", // 36
	"лхм мюоп тюгш S ", // 37
	"лхм мюоп тюгш T ", // 38
	"люйя мюоп тюгш R", // 39
	"люйя мюоп тюгш S", // 40
	"люйя мюоп тюгш T", // 41
	"меноп вепед тюг ", // 42
	"меаюкюмя/напшб U", // 43
	"слем мюоп тюгш R", // 44
	"слем мюоп тюгш S", // 45
	"слем мюоп тюгш T", // 46
	"мюоп тюгш R 47% ", // 47
	"мюоп тюгш S 47% ", // 48
	"мюоп тюгш T 47% ", // 49
	"  веп тюг яерх  ", // 50
	"     пегепб     ", // 51
						//!----------------
	"   мер юбюпхи   ", // 52
	"  напшб тюгш U  ", // 53
	"  напшб тюгш V  ", // 54
	"  напшб тюгш W  ", // 55
	"бп-рнй оепецпсгй", // 56
	"     пегепб     ", // 57
	"   йг тюгш U    ", // 58
	"   йг тюгш V    ", // 59
	"   йг тюгш W    ", // 60
	"     пегепб     ", // 61
	"     пегепб     ", // 62
	" лхмхлюкэм рнй  ", // 63
	" меаюкюмя рнйю  ", // 64
	"     пегепб     ", // 65
	"     пегепб     ", // 66
	"     пегепб     ", // 67
	"     пегепб     ", // 68
	//!----------------
	"   мер юбюпхи   ", // 69
	"яани дюрв онкнф ", // 70
	" яани оюлърх 1  ", // 71
	" яани оюлърх 2  ", // 72
	"   яани вюянб   ", // 73
	"яани дюрв релоеп", // 74
	" оепецпеб акнйю ", // 75
	"оепенукюфд акнйю", // 76
	"  яани ря/рс    ", // 77
#if BUR_M
	"     пегепб     ", // 78
#else
	"бшйкчвемхе акнйю", // 78
#endif
	"     пегепб     ", // 79
	"     пегепб     ", // 80
	"йпхр оепецпеб ак", // 81
	"ме гюдюмн бпелъ ", // 82
	"     пегепб     ", // 83
	"     пегепб     ", // 84
	"  акнй бйкчвем  ", // 85
	//!----------------
	"  мер яхцмюкнб  ", // 86
	"  бунд нрйпшрэ  ", // 87
	"  бунд гюйпшрэ  ", // 88
	"   бунд ярно    ", // 89
	"    бунд лс     ", // 90
	"    бунд дс     ", // 91
	"бунд деакнйхпнбй", // 92
	"     пегепб     ", // 93
	"     пегепб     ", // 94
	"     пегепб     ", // 95
	"     пегепб     ", // 96
	"     пегепб     ", // 97
	"     пегепб     ", // 98
	"     пегепб     ", // 99
	"     пегепб     ", // 100
	"     пегепб     ", // 101
	"     пегепб     ", // 102
						//!----------------
#if BUR_M
	"  мер яхцмюкнб  ", // 103
	"    пегепб      ", // 104
	"    пегепб      ", // 105
	"     лстрю      ", // 106
	"     юбюпхъ     ", // 107
	"    пегепб      ", // 108
	"     охрюмхе    ", // 109
	"     гюйпшрн    ", // 110
	"     нрйпшрн    ", // 111
	" мехяопюбмнярэ  ", // 112
	"     пегепб     ", // 113
	"     пегепб     ", // 114
	"     пегепб     ", // 115
	"     пегепб     ", // 116
	"     пегепб     ", // 117
	"     пегепб     ", // 118
	"     пегепб     ", // 119
#else
	"  мер яхцмюкнб  ", // 103
	"    юбюпхъ      ", // 104
	"    гюйпшрн     ", // 105
	"    нрйпшрн     ", // 106
	"     лстрю      ", // 107
	"  гюйпшбюеряъ   ", // 108
	"  нрйпшбюеряъ   ", // 109
	"     лс/дс      ", // 110
	"  мехяопюбмнярэ ", // 111
	"     пегепб     ", // 112
	"     пегепб     ", // 113
	"     пегепб     ", // 114
	"     пегепб     ", // 115
	"     пегепб     ", // 116
	"     пегепб     ", // 117
	"     пегепб     ", // 118
	"     пегепб     ", // 119
#endif
	//!----------------
	" мер йюкхапнбйх ", // 120
	" гюдюмн гюйпшрн ", // 121
	" гюдюмн нрйпшрн ", // 122
	"йюкхап бшонкмемю", // 123
	//!----------------
	"    йкхмнбюъ    ", // 124
	"    ьхаепмюъ    ", // 125
	//!----------------
	"  ме нопедекем  ", // 126
	" аег сокнрмемхъ ", // 127
	"сокнрмемхе гюйп ", // 128
	"сокнрмемхе нрйп ", // 129
	"сок гюйп х нрйп ", // 130
	//!----------------
	"   мнплюкэмши   ", // 131
	"    напюрмши    ", // 132
	//!----------------
	"деиярб гмювемхъ ", // 133
	"опнжемрш нр мнл ", // 134
	//!----------------
	"    бшйкчвем    ", // 135
	"  бшанп пефхлю  ", // 136
	"    пефхл лс    ", // 137
	"    пефхл дс    ", // 138
	//!----------------
	" бяе хмрептеияш ", // 139
	"рнкэйн дхяйперм ", // 140
	"рнкэйн онякеднб ", // 141
	//!----------------
	"   бшйкчвемю    ", // 142
	"    бйкчвемю    ", // 143
	//!----------------
	"      24б       ", // 144
	"      220б      ", // 145
	//!----------------
	"    2400 анд    ", // 146
	"    4800 анд    ", // 147
	"    9600 анд    ", // 147
	"   19200 анд    ", // 149
	"   38400 анд    ", // 150
	"   57600 анд    ", // 151
	"   115200 анд   ", // 152
	//!----------------
	"   бшйкчвемю    ", // 153
	" хмдхй мю акнйе ", // 154
	"хмд мю акнйе/ря ", // 155
	"хмдхй х нярюмнб ", // 156
	//!----------------
	"  мер йнлюмдш   ", // 157
	"     гюдюрэ     ", // 158
	"    яапняхрэ    ", // 159
	//!----------------
	"  мер йнлюмдш   ", // 160
	"    яапняхрэ    ", // 161
	//!----------------
	"  мер йнлюмдш   ", // 162
	"      ярно      ", // 163
	"    гюйпшрэ     ", // 164
	"    нрйпшрэ     ", // 165
	"  гюйпшрэ реяр  ", // 166
	"  нрйпшрэ реяр  ", // 167
	"     пегепб     ", // 168
	"     пегепб     ", // 169
	"     пегепб     ", // 170
	//!----------------
	"  мЕР ЙНЛЮМДШ   ", // 171
	"гЮОХЯЮРЭ СПНБ. 1", // 172
	"гЮОХЯЮРЭ СПНБ. 0", // 173
	"яНУПЮМХРЭ ДЮММШЕ", // 174
	//!----------------
	"   осщ v 0.013  ", // 175
	"   осщ v 0.014  ", // 176
	//!----------------
	"я ондрбепфдемхел", // 177
	"    пюгпеьемн   ", // 178
	"    гюопеыемн   ", // 179
	//!----------------
	" аег хглемемхи  ", // 180
	"  онкнфемхе/10  ", // 181
	//!----------------
	" ме нопедекемн  ", // 182
	"напюрм онякеднб ", // 183
	"опълюъ онякеднб ", // 184
	//!----------------
	"    нярюмнб     ", // 185
	" юбрнлюрхвеяйхи ", // 186
	"  хцмнпхпнбюмхе ", // 187
	//!----------------
	"    бшйкчвем    ", // 188
	"    бйкчвем     ", // 189
	//!----------------
	"дбсутюгнбне рнпл", // 190
	"рпеутюгнбне рнпл", // 191
	//!----------------
	" ярюрся пюанрш  ", // 192
	" дхюцм опнжеяяю ", // 193
	" дхюцмняр яерх  ", // 194
	" дхюцм мюцпсгйх ", // 195
	" дхюцм сярп-бю  ", // 196
	"  яняр бунднб   ", // 197
	"  яняр бшунднб  ", // 198
	"     пегепб     ", // 199
	"     лнлемр     ", // 200
	"    яйнпнярэ    ", // 201
	"  япедмее мюоп  ", // 202
	"  япедмхи рнй   ", // 203
	" сцнк мюцпсгйх  ", // 204
	"     пегепб     ", // 205
	"     пегепб     ", // 206
	"     пегепб     ", // 207
	"     пегепб     ", // 208
	//!----------------
	" аег хглемемхи  ", // 209
	"пюглшй йбн х йбг", // 210
	"пюгл йпюрйнбпел ", // 211
	//!----------------
	"бшярюбк он тюйрс", // 212
	" бяецдю сяр. б 1", // 213
	//!----------------
	" BLUEGIGA WT41-A", // 214
	" Silicon BGM210P", // 215
	//!----------------
	"    бйкчвем     ", // 216
	"    бшйкчвем    ", // 217
	//!----------------
	"     пегепб     ", // 218
	"     пегепб     ", // 219
	//!----------------
	"  мнбши лернд   ", // 220
	"  ярюпши лернд  ", // 221
	//!----------------
	"  он сярюбйюл   ", // 222
	"он сяр я гюдепфй", // 223
	" бяецдю бйк     ", // 224
	" псвмне соп     ", // 225
	//!----------------
	"  аег опнбепйх  ", // 226
	" мю мевермнярэ  ", // 227
	"  мю вермнярэ   ", // 228
	//!----------------
	"ме нопедекем    ", // 229
	"щож-100 ю.25 с  ", // 230
	"щож-100 ю.50 с  ", // 231
	"щож-400 а.20 с  ", // 232
	"щож-400 а.50 с  ", // 233
	"щож-800 б.40 с  ", // 234
	"щож-1000 б.20 с ", // 235
	"щож-4000 ц.9 с  ", // 236
	"щож-4000 ц.18 с ", // 237
	"щож-10000 д.6 с ", // 238
	"щож-10000 д.12 с", // 239
	"щож-100 ю.25 я  ", // 240
	"щож-100 ю.50 я  ", // 241
	"щож-400 а.20 я  ", // 242
	"щож-400 а.50 я  ", // 243
	"щож-800 б.40 я  ", // 244
	"щож-1000 б.20 я ", // 245
	"щож-4000 ц.9 я  ", // 246
	"щож-4000 ц.18 я ", // 247
	"щож-10000 д.6 я ", // 248
	"щож-10000 д.12 я", // 249
	"щож-400 а.40 с  ", // 250
	"щож-400 а.20 я2 ", // 251
	"щож-10й д.12 с2 ", // 252
	"щож-10й д.6 с2  ", // 253
	//!----------------
	"  OLED WINSTAR  ", // 254
	"   VAC FUTABA   ", // 255
	//!----------------
	"рнплнфем. ярюпне", // 256
	"рнплнфемхе мнбне", // 257
	//!----------------
	" осяй гюопеыем  ", // 258
	" осяй пюгпеьем  ", // 259
						//!----------------
	"  AVAGO         ", // 260
	"  яйа хя        ", // 261
						//!----------------
	"  мЕР ЙНЛЮМДШ   ", // 262
	"    бйкчвхрэ    ", // 263
	"    бшйкчвхрэ   ", // 264
						//!----------------
	"   до ХЯОПЮБЕМ  ", // 265
	"яАНХ Б ПЮАНРЕ до", // 266
						//!----------------
	"  0 x рЮИЛЮСР   ", // 267
	"  аЕГ ЛМНФХРЕКЪ ", // 268
	"  2 x рЮИЛЮСР   ", // 269
	"  3 x рЮИЛЮСР   ", // 270
	"  4 x рЮИЛЮСР   ", // 271
	"  5 x рЮИЛЮСР   ", // 272
	//!----------------
	"    бШЙКЧВЕМ    ", // 273
	"пЮГДЕКЭМШЕ ярно ", // 274
						//! яРПНЙХ ЙНМЕЖ
};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн", // 0
	"    йнлюмдю     ", // 1
	"    нрлемемю    ", // 2
	"  о 999.99%     ", // 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?", // 4	0
	"    дю  мер     ", // 5
	" гюдюрэ лнлемр  ", // 6	1
	"йюкхапнбйх  нй  ", // 7
	" рхо йюкхапнбйх ", // 8	2
	" псвм  йнк.нанп ", // 9
	"оепебедх б онкнф", // 10	3
	" гюйпшрн   нй   ", // 11
	"оепебедх б онкнф", // 12	4
	" нрйпшрн   нй   ", // 13
	"оепебедх б йпюим", // 14	5
	"онкнфемхе   нй  ", // 15
	"   онкнфемхе    ", // 16	6
	"   гюйп  нрйп   ", // 17
	"опнбепхрэ йюкха?", // 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ", // 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ", // 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ", // 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ", // 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ", // 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ", // 30	13
	"  лнлемрш   нй  ", // 31
	" сопюбкемхе лс  ", // 32
	" гюакнйхпнбюмн  ", // 33
	//--------------------------------
	"дкъ ондрбепфдем.", // 34
	" мюфлхре 'ббнд' ", // 35
	" педюйрхпнбюмхе ", // 36
	"оюпюл. пюгпеьемн", // 37
	"   мебепмши     ", // 38
	"  йнд днярсою   ", // 39
	"   йнд днярсою  ", // 40
	"     яапньем    ", // 41
	"сярюмнбкем мнбши", // 42
	"  йнд днярсою   ", // 43
	" ббедеммше йндш ", // 44
	"  ме янбоюдючр! ", // 45
	//--------------------------------
	"йюкхапнбйю окюрш", // 46
	"хмрептеиянб пюгп", // 47
	"йюкхапнбйю окюрш", // 48
	"хмрептеиянб гюоп", // 49
	//--------------------------------
	"сЯРЮМНБКЕМ СПНБ.", // 50
	"КНЦХВ. '*' *2* б", // 51
	" дЮММШЕ СЯОЕЬМН ", // 52
	"   ЯНУПЮМЕМШ    ", // 53
	//--------------------------------
	"бЙКЧВЕМН РЕЯРХП.", // 54
	"ДЮРВХЙЮ ОНКНФЕМ.", // 55
	"бШОНКМХРЕ ОСЯЙ Б", // 56
	"     нрйпшрн    ", // 57
	"     гюйпшрн    ", // 58
	"  дХЮЦМНЯРХЙЮ до", // 59
	"    ГЮБЕПЬЕМЮ   ", // 60
	"дЮРВХЙ ОНКНФЕМХЪ", // 61
	"    ХЯОПЮБЕМ    ", // 62
	" нАМЮПСФЕМШ ЯАНХ", // 63
	"   Б ПЮАНРЕ до  ", // 64
};

// ТХЙЯХПНБЮММШЕ РНВЙХ ДКЪ ЯМЪРХЪ ЛНЛЕМРЮ
Int VoltArray[CUB_COUNT1] = {160, 190, 220, 250};
Int CurrArray[CUB_COUNT2] = {400, 800, 1200, 1600, 2000, 3000}; // ДНАЮБХК 3000 PIA 19.05.15
Int AnUIArray[CUB_COUNT2] = {25, 35, 50, 65, 70, 80};			// ДНАЮБХК 70 	PIA 19.05.15
Int TorqArray[CUB_COUNT2] = {25, 35, 50, 75, 100, 120};			// ДНАЮБХК 120 	PIA 19.05.15

#if !TORQ_TEST
TCubConfig TqCurr = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Imidpr, CurrArray};
TCubConfig TqAngUI = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Ram.GroupA.AngleUI, AnUIArray};
TCubConfig TqAngSf = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#else
TCubConfig TqCurr = {(Int *)&TqUmid, VoltArray, (Int *)&TqImidPr, CurrArray};
TCubConfig TqAngUI = {(Int *)&TqUmid, VoltArray, (Int *)&TqAnUI, AnUIArray};
TCubConfig TqAngSf = {(Int *)&TqUmid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#endif

char Icons[NUM_ICONS][7] = {
	0x1F,
	0x11,
	0x1F,
	0x04,
	0x06,
	0x04,
	0x07,
	0x1F,
	0x11,
	0x11,
	0x1F,
	0x04,
	0x1F,
	0x00,
	0x06,
	0x15,
	0x0D,
	0x06,
	0x0D,
	0x015,
	0x06,
	0x0E,
	0x11,
	0x11,
	0x11,
	0x1F,
	0x1B,
	0x1F,
	0x0E,
	0x11,
	0x10,
	0x10,
	0x1F,
	0x1B,
	0x1F,
};

#endif // CREATE_STRUCTS

// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadAddStr(Str, Index) \
	PFUNC_blkRead((int16 *)&AddStr[Index], (int16 *)Str, 16)

// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadValuesStr(Str, Index) \
	PFUNC_blkRead((int16 *)&values[Index], (int16 *)Str, 16)

extern const struct MENU_GROUP groups[];
extern const struct MENU_PARAM params[];
extern const struct MENU_STRING values[];
extern const struct MENU_STRING AddStr[];
extern TCubConfig TqCurr;
extern TCubConfig TqAngUI;
extern TCubConfig TqAngSf;
extern char Icons[NUM_ICONS][7];

#endif
